const 图例纵向位置起始 = 450;
const 图例行高 = 50;
const 图例色相起始 = 0;

const 等级们 = [
    '居住 7',
    '短居 4',
    '游玩 3',
    '出差 2',
    '路过 1',
    '没去过',
];

const 更新等级 = () => {
    const 等级数量 = 等级们?.length;
    const 色相步幅 = 360 / 等级数量;

    // 图例
    let 图例纵向位置 = 图例纵向位置起始;
    let 图例色相 = 图例色相起始;
    let 等级图例文档 = '';
    // 选择弹窗
    let 等级选择弹窗文档 = '';

    等级们.forEach((等级, 下标) => {
        const 颜色 = (下标 === 等级数量 - 1)
            ? "#fff"
            : `hsl(${图例色相}, 100%, 75%)`;

        等级图例文档 += `<path fill="${颜色}" d="M983 ${图例纵向位置}h120v50H983Z"/>`;
        等级图例文档 += `<text x="1000" y=${图例纵向位置 + 35}>${等级}</text>`;

        const [文字, 分数] = 等级?.split(' ');
        等级选择弹窗文档 += `<a data-level=${分数 || 0} style="background:${颜色}">${文字}</a>`;

        图例纵向位置 += 图例行高;
        图例色相 += 色相步幅;
    });
    等级图例文档 += `<path class="边框" d="M983 ${图例纵向位置起始}h120v${图例行高 * 等级数量}H983Z"/>`;
    等级图例.innerHTML = 等级图例文档;
    设置等级列表.innerHTML = 等级选择弹窗文档;
};

更新等级();
